Openfoam-Xeon-host/OpenFOAM-2.3.1/tutorials/compressible/rhoPimpleDyMFoam/annularThermalMixer/0.org/mut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      mut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "${FOAM_CASE}/constant/caseSettings"

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet       { $:calculated.mut; }
    outlet      { $:calculated.mut; }
    movingWalls { $:wall.mut; }
    staticWalls { $movingWalls; }

    #include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes"
}

// ************************************************************************* //
